{"129628193811464193": {"Trade": "Empty", "EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/129628193811464193/0ad192a28ccd55eb9825f824ff2d9077.webp?size=1024"}, "fields": [{"inline": true, "name": "MTG Colours", "value": "Izzet Centered Jeskai? I think"}, {"inline": true, "name": "MTG Format of Choice", "value": "Limited these days!"}, {"inline": true, "name": "Favourite Food", "value": "Steak, spicy steak, or spicy"}, {"inline": true, "name": "You can ping me if", "value": "Anytime! Especially if my bot is being rude"}, {"inline": true, "name": "Fact about me!", "value": "I'm still very unsure about the colourpie! I often feel new even though I've been here for ages!"}], "color": 0, "type": "rich", "description": "Hi! I'm Thomas, a 22 year old English and Creative Writing grad from the UK (easy to miss, because I don't sleep) I am currently the Jeskai councillor here and code the colour pie bot! Nice to meet you!", "title": "Tinny's Profile"}}, "697402445244137499": {"reps": []}, "226903569553555466": {"Trade": "554854374179078154"}, "554854374179078154": {"Trade": "697402445244137499", "EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/554854374179078154/3c5b859a5d549207078712d61bb5c965.webp?size=1024"}, "fields": [{"inline": true, "name": "Tonalidad asonante de un alma inconsistente", "value": "My colors are Izzet + Golgari. My internal world and motivations are the former, my external world and aspirations are the later. To synthesize, as I would love to overcomplexify my own colors for your entertainment."}, {"inline": true, "name": "Preferred Format", "value": "I like to draft on Arena, theoretically ponder about commander and just enjoy making my own way to play the game with proxies and friends. Westvale Abbey will be my commander if I want to!"}, {"inline": true, "name": "My Epicurean Streaks", "value": "I don't know if I have hobbies for the same reason I don't know if I technically work. I only do things that I enjoy and if there's some financial compensation attached to that, then cool. But I do enjoy to do nothing, doing nothing is my hobby."}, {"inline": true, "name": "My Card", "value": "✡︎□︎◆︎ ♍︎♋︎■︎ ⬧︎◆︎❍︎❍︎□︎■︎ ❍︎♏︎ ⬥︎♒︎♏︎■︎♏︎❖︎♏︎❒︎ ⍓︎□︎◆︎ ⬥︎♋︎■︎⧫︎📬︎ ✋︎ ♍︎♋︎■︎🕯︎⧫︎ ◻︎❒︎□︎❍︎♓︎⬧︎♏︎ ⍓︎□︎◆︎ ♋︎⧫︎⧫︎♏︎■︎♎︎♋︎■︎♍︎♏︎ □︎❒︎ ◆︎⬧︎♏︎♐︎◆︎●︎■︎♏︎⬧︎⬧︎📪︎ ♌︎◆︎⧫︎ ✋︎ ♏︎■︎🙰□︎⍓︎ ◻︎♋︎♍︎⧫︎⬧︎📬︎"}, {"inline": true, "name": "My Typology Based Mythology", "value": "ENTP, Aries, Griffindor, Ehecatl, Tiger, O-, Flat-Earther, 4w5, I strongly identify with ravens and cephalopods"}], "color": 8421376, "type": "rich", "description": "♡ spuəıɹɟ ɟo ʇsəq əɥʇ əq llıʍ əʍ 'ɐıpəɯ lɐıɔos əʇɐɥ ı 'ɔıʇuɐɯoɹ ɐ ɯ,ı ˙pɐəɹ ʇ,uəʌɐɥ ı sʞooq əɥʇ ɯoɹɟ uoıʇɔıɟ ɟo sʞɹoʍ lnɟbuıuɐəɯ əʇɐəɹɔ oʇ sʎɐʍ ɹoɟ buıʞool s,oɥʍ ʇsıboloʇoubɐ ɹnəʇɐɯɐ 'əɔuɐɹoubı ɟo əldıɔsıp ɐ ɯ,ı ˙ʎɔuəʇsısuoɔuı puɐ səʞɐʇsıɯ 'ʎʇləʌou əʞıl ʞool ʇɐɥʇ sʞɔıɹʇ dɐəɥɔ ɥʇıʍ əʌol uı ɯ,ı suɐəɯ sıɥʇ ˙ɹolıɔunoɔ soɐɥɔ ɹnoʎ puɐ uəənb buıɔuɐp 'ʇsıʇɹɐ lɐnsıʌ ɐ 'əɯıʇ əɥʇ ɟo ʇsoɯ pəɹoq ɯ,ı", "title": "Bored"}}, "344202345623584788": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/344202345623584788/940a26a25e7b3a06366c825d926b5b66.webp?size=1024"}, "fields": [{"inline": true, "name": "     What are your colours?", "value": "Esper."}, {"inline": true, "name": "Where do you live?", "value": "Scotland, although my sleep cycle is more of a sleep rollercoaster, so I might be available at weird times.     "}, {"inline": true, "name": "What is your view of the pie?", "value": "I'm Maro-compatibilist, and not minimalist. That is, the pie must be compatible with Maro's views, but can be extended, and the three-word descriptions are insufficient."}, {"inline": true, "name": "What are your hobbies?", "value": "MtG (usually on Arena, although I've got some paper cards), D&D (again usually online), generally nerding out online, and karaoke."}, {"inline": true, "name": "What types are you in other systems?", "value": "ENTP, 6w7-8w7-3w4 so/sp, EIE, EVLF, astrology is bullshit."}], "color": 0, "type": "rich", "description": "Hi, I'm Jerdle, 21-year-old nerd and owner and creator of this server. I'm studying maths and philosophy, and used to take CS, so can code (although I didn't code the bot).", "title": "Jerdle"}}, "719598761638363329": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/719598761638363329/77f6ee15eced0c0efc258daa1a87b75e.webp?size=1024"}, "fields": [{"inline": true, "name": "What are your colors?", "value": "Azorius + Green, thank you for asking!"}, {"inline": true, "name": "How about hobbies?", "value": "I enjoy MTG (particularly Pauper and EDH), Warhammer, and D&D. Basically, I'm a massive tabletop game nerd."}, {"inline": true, "name": "What's your view on the pie?", "value": "Well, I think its flexible. It can be used to color *just* values, or personality traits, vibes, aesthetics, or a big mix! I personally like using a mixture, which is why I struggle with Green aesthetically and vibe-wise. But I'm trying!"}, {"inline": true, "name": "What do you want to do with your life?", "value": "Find a) a skill or hobby to devote my free time to, and b) a stable career that won't be taken by robots. From there, either I settle down with my loved one, or I try to take over the world. We'll cross that bridge when we come to it."}, {"inline": true, "name": "Thanks for your time!", "value": "No problem! I'm slightly narcissistic and love talking about myself, thanks for taking the time to ask."}], "color": 8438015, "type": "rich", "description": "Hey there! I'm the *Other* Will, and I'm a 14 year old member of the r/colorpie server who likes school. And authority figures. And systems to rank achievement, like the grades. Which are given out by authority figures. In school.", "title": "Other Will"}}, "485463130613481483": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/485463130613481483/63322f33967b25a2bbddd2ba9225973f.webp?size=1024"}, "fields": [{"inline": true, "name": "What colors am I?", "value": "I think I’m Esper, but I’m not entirely sure. I know my color order is <:5wm:719986148453384192> > <:5um:719986148235018291> > <:5bm:719986148692197527> > <:5gm:719986148448927744> > <:5rm:719986148474355722>, but the cut off is up in the air. I’ve been methodically refining my colors for more than a year, but I’m procrastinating on finishing that up."}, {"inline": true, "name": "What’s my chromatic affiliation?", "value": "I tend to adhere to Maro’s writings as a color pie lingua franca, but I have an idea for a color pie based solely on the 3-word ideologies that I’ve been procrastinating on."}, {"inline": true, "name": "Am I in any secret pacts?", "value": "Yes, but they wouldn’t be a secret if I told you what they were."}, {"inline": true, "name": "Am I in any public pacts?", "value": "Yes, I’m in the Order of the Banhammer with Other Will, an organization dedicated to enforcing rules upon the server. Ping either of us if you’d like the rules of the organization or would like to join."}, {"inline": true, "name": "Is there anything I left out of my description to make that clone joke?", "value": "Yes, quite a bit actually. I’ll put it all here because I ran out of question slots. I’m a mod here and the owner of the sub. I joined the server very early on. I don’t actually play Magic, I just got here because I really like #typology systems and reddit decided I’d like the color pie. In those various typing systems I’m an ENTP, Ravenclaw primary/Slytherin secondary, Authleft, and 1w9, though I haven’t looked into Enneagram much. I live in Montana, though I’m not sure why you’d care. I have a Boros mom, a Sultai dad, and a Rakdos little brother. I’m almost the youngest member, but I think Will is slightly younger. My hobbies are mostly just learning stuff on the internet, with me occasionally learning things IRL. Oh, and I’ve done Debate and Drama before, plus Yearbook and Fun Facts Club, the latter of which I founded and is exactly what it sounds like. Oh, and I really don’t like red."}], "color": 4227264, "type": "rich", "description": "Hello! I’m Mucus Patty. I could prbably write a description of my own, but you can just read Other Will’s, given we’re pretty much clones of each other.", "title": "Mucus Patty"}}, "618179895641505853": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/618179895641505853/b3a4668dc964e91c4411b35b01d45158.webp?size=1024"}, "fields": [{"inline": true, "name": "Color Identity", "value": "I am honored to be the Grixis counselor here on this server, and my color identity falls somewhere within Artifice, depending on who you ask."}, {"inline": true, "name": "Preferred Format", "value": "EDH is the only good choice. Plus, the only one I play."}, {"inline": true, "name": "Hobbies", "value": "Kinda already explained this in my intro, but: scheming, gathering random data to make graphs and charts, making robots, warhammer, mtg, hanging out with friends, the occasional illicit activity."}, {"inline": true, "name": "Contact", "value": "Feel free to ping me/talk to me about pretty much anything. I'll probably answer, and if I'm not interested I'll just ignore it."}, {"inline": true, "name": "Ambitions", "value": "I'm unironically obsessed with immortality, and even if I can't quite get there I hope my work will benefit humanity's scientific progress."}], "color": 10485952, "type": "rich", "description": "Greetings, puny mortals. I am Shrike, lord of extropy, aspiring immortalist, and herald of your salvation. But fr yo I'm a 17-year-old high school student that lives in Texas but schemes to gtfo for college where I plan to study biotechnology. I work for the city as a counselor for a summer camp, I enjoy nerd shit like Warhammer and MtG, and I love working with my district robotics team to fund, machine, build, and repair robots. I break laws and collect random data for fun and absolutely can't stand isolation, so on the few occasions I'm not hanging out with friends or with other people for some reason or another, I'm probably talking to people online -and this server is my favorite place to do that!", "title": "Shrike"}}, "275724462479900683": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/275724462479900683/4bc9f15bc2473b8dc6ace4a4c11400cc.webp?size=1024"}, "fields": [{"inline": true, "name": "Color identity", "value": "Dimir / Esper / Grixis / Sultai"}, {"inline": true, "name": "Join date", "value": "April 2, 2020 https://discord.com/channels/695401740761301056/695401740761301059/695496363517018122"}, {"inline": true, "name": "Contributions", "value": "I compiled the masterpost of Loreleywrites’ color analyses, which is available through <#696488842844438649> and hosted on Reddit."}, {"inline": true, "name": "Hobbies", "value": "Games (primarily Dead by Daylight), roleplaying, creative projects, consuming various entertainment media"}, {"inline": true, "name": "Favorite food", "value": "Indian chicken curry, spicy foods"}], "color": 255, "type": "rich", "description": "***Creative Proficiencies:*** **Writing and language:** I earned my bachelor’s degree in Writing Studies. **Pencil and digital art:** I have been honing my drawing skills from a very early age. As a child, before I could read or write, I used to draw comic stories and then have adults write in the words I wanted characters to speak. **Video editing:** I began developing my skills in video editing once I started uploading gameplay footage as a hobby. My main accomplishment in this area is selling my services to popular YouTuber Otzdarva. I am credited in the description of his video “Otz & Tru3 discuss DBD,” for which I did all the editing. The uploaded video is exactly as I sent it to him. **Digital music:** I have dabbled in digital music, with mixed results. Some of which I’m very proud of. I’m primarily interested in it for the purposes of narrative accompaniment, such as video game music or character themes. I once made a game called “Creature from the Ashen Wood,” which is available free online.", "title": "State of Bedlam"}}, "254328107836637184": {"Trade": "Empty"}, "554715687835271189": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/554715687835271189/0c1b1ff69584c70ae50479b072d0f5c0.webp?size=1024"}, "fields": [{"inline": true, "name": "What are your colors?", "value": "My primary colors are Black and Green. I dip into the other three as needed or wanted, depending on where I'm at in life."}, {"inline": true, "name": "What is your preferred format?", "value": "I enjoy Pauper the most, though I play Commander like everybody else."}, {"inline": true, "name": "When can you tag me?", "value": "Whenever, within reason. Please don't spam it, and don't be insulted if I don't reply. I enjoy making new members feel comfortable, so feel free to reach out to me if you have questions."}, {"inline": true, "name": "These are a few of my favorite things:", "value": "Puns, meat, theater music, a lack of responsibility, beer, weightlifting, the Legend of Zelda, joy, accomplishing goals, sitcoms."}, {"inline": true, "name": "Favorite Magic card:", "value": "Rakdos Charm. Not very Golgari of me, but here we are."}], "color": 32768, "type": "rich", "description": "Hi, I'm Creevy; it's nice to meet you.", "title": "Creevy"}}, "182965585166991360": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/182965585166991360/e4a1d09ec44fa0b8bcb10cfd9e8beb28.webp?size=1024"}, "fields": [{"inline": true, "name": "Colors", "value": "I'm primarily Green/Blue but I dabble in the other colors occasionally."}, {"inline": true, "name": "Preferred formats", "value": "I mostly play EDH and cube, along with Modern and Legacy occasionally."}, {"inline": true, "name": "View of the pie", "value": "I have a pretty loose view of the pie, I think it has a lot of flexibility as a system but is generally centered around one's values, though that's certainly not all it can cover."}, {"inline": true, "name": "Hobbies", "value": "Music, writing, reading fantasy books, studying people, traveling"}, {"inline": true, "name": "Typology stuff", "value": "Sexual 5 (w4), 592 tritype, INTP, LII-3Ne"}], "color": 49328, "type": "rich", "description": "description", "title": "Cosmia"}}, "752522489405374536": {"reps": ["puts up with me while I fuck with the bot"]}, "595329995879219233": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/595329995879219233/1a1ea383aac91f7aeeef02501cf92242.webp?size=1024"}, "fields": [{"inline": true, "name": "MTG Colors", "value": "Green, stretching out to the borders of Naya"}, {"inline": true, "name": "IRL Facts", "value": "Trans man, 29 y/o, 152cm, omnisexual, polyamorous, multiple system, oldest of 8 kids, living in Portland Oregon USA, ADHD, loves snuggles"}, {"inline": true, "name": "Favorite Things", "value": "Pumpkin Pie, Teal, Dogs, the number 11, Gallade, snuggles, Autumn, Fairies, Hozier, *No Game No Life*, *HPMOR*, Blades In The Dark, Bard (Glamour), Eggs Over-Medium"}, {"inline": true, "name": "DMs?", "value": "Always Open. I love making new friends. Talk to me about your worldbuilding project!"}, {"inline": true, "name": "My Dog", "value": "Calcifur is a 2~ y/o Havanese/Poodle. He was gifted to me by a neighbor who wasn't equipped to deal with his anxiety and behavioral issues. His colors are White>Red."}], "color": 49152, "type": "rich", "description": "description", "title": "Wonder"}}, "210258978498805762": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/210258978498805762/44fd8ef30c10ae1c6050007f0d2f7036.webp?size=1024"}, "fields": [{"inline": true, "name": "ʙᴀsɪᴄs", "value": "i am 24 as of november 8th, something resembling a demiboy gender-wise {he/they/it}, heavily neurodivergent, and i live with questionable-to-terrible parents in the greater toronto area"}, {"inline": true, "name": "ᴄᴏʟᴏᴜʀs", "value": "i'm blue. that's about it! people are split on whether or not white or black is my secondary. i have negligible amounts of green and red. also i spell it colour because i've got canada"}, {"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "ᴛʏᴘᴏʟᴏɢʏ", "value": "♏ 🌞 ♒ 🌝 ♎ ⬆️ // intj...??? // 3w2 5w6 1w2 i think // my classpect is that i related to dave when i was dave's age. // fuck jk rowling"}], "color": 33023, "type": "rich", "description": "hello! my name is albus taskell. people here call me jace because i am. this profile gets to be for me, and if other members of the tales system ever decide to talk here, remind me to brush up their pluralkit profiles. or just ask them what you want to know!", "title": "ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ᴍʏ ᴛᴡɪsᴛᴇᴅ ᴍɪɴᴅ"}}, "883521900985352252": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/883521900985352252/338c37e0fca05a2d1f920766f85a1959.webp?size=1024"}, "fields": [{"inline": true, "name": "1. **What is your Color Order?**", "value": "I’m Chaos. Green and Blue fighting for first and second, and Red and Black fighting for third and fourth."}, {"inline": true, "name": "3. **Favorite Mtg Format?**", "value": "4. Commander! I don’t play much, but if I did, it’ll be Commander 100% of the time"}, {"inline": true, "name": "5. **Hobbies?**", "value": "6. 6. Field contents"}, {"inline": true, "name": "7. 7. Field Title", "value": "8. 8. Field contents"}, {"inline": true, "name": "9. 9. Field Title", "value": "10. 10. Field contents"}], "color": 0, "type": "rich", "description": "Hi, I’m Dreadful! I’m the current Temur councillor. Nice to meet you! 😄", "title": "Dreadful’s Profile"}}, "870733998358409258": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/870733998358409258/6e26fda6fbdae1770c86749ba2cd0ca9.webp?size=1024"}, "fields": [{"inline": true, "name": "Base Colors", "value": "Selesnya (green/white)"}, {"inline": true, "name": "Importance", "value": "Compassion"}, {"inline": true, "name": "5. Field Title", "value": "6. Field contents"}, {"inline": true, "name": "7. Field Title", "value": "8. Field contents"}, {"inline": true, "name": "9. Field Title", "value": "10. Field contents"}], "color": 0, "type": "rich", "description": "description", "title": "Nyx, Starlight Acolyte"}}, "556990597450432524": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/556990597450432524/a65701ddf5d17f584dd4c9a16e386034.webp?size=1024"}, "fields": [{"inline": true, "name": "1. Field Title", "value": "2. Field contents"}, {"inline": true, "name": "3. Field Title", "value": "4. Field contents"}, {"inline": true, "name": "5. Field Title", "value": "6. Field contents"}, {"inline": true, "name": "7. Field Title", "value": "8. Field contents"}, {"inline": true, "name": "9. Field Title", "value": "10. Field contents"}], "color": 8438015, "type": "rich", "description": "description", "title": "Hank's Profile"}}, "303184147642318848": {"EmbedStructure": {"thumbnail": {"url": "https://cdn.discordapp.com/avatars/303184147642318848/498aaf463e12b02763e50f36b30b18e0.webp?size=1024"}, "fields": [{"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "Field Title", "value": "Field contents"}, {"inline": true, "name": "Field Title", "value": "Field contents"}], "color": 12615872, "type": "rich", "description": "description", "title": "title"}}, "842106129734696992": {"reps": ["botlod"]}, "719598761638363329": {"reps": ["being my bestie", "."]}, "883521900985352252": {"reps": ["being my bestie", "plantita", "."]}, "202630682520977410": {"reps": ["being kewl"]}, "554715687835271189": {"reps": ["being kewl"]}, "339025572267032586": {"reps": ["she kewl", "."]}, "581632000884998155": {"reps": ["he my bestie"]}, "554854374179078154": {"reps": ["."]}, "896587419606974575": {"reps": ["All around great guy", "."]}, "842106129734696992": {"reps": ["You made the bot lol"]}, "695458770867847174": {"reps": ["."]}, "344202345623584788": {"reps": ["."]}, "752522489405374536": {"reps": ["."]}, "226903569553555466": {"reps": ["p", "p", "p", "p", "p", "p", "p"]}, "227054754113519616": {"reps": ["being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan", "being Abzan"]}, "207201579282071553": {"Trade": "Empty"}}